# ExportLinetypeKey Properties

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExportLinetypeKey Properties
ExportLinetypeKey Class See Also
---
The ExportLinetypeKey type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| OriginalLinetypeName | The original linetype name. |

# See Also
ExportLinetypeKey Class
Autodesk.Revit.DB Namespace